---
kind: method
id: M:Autodesk.Revit.DB.EdgeArray.ReverseIterator
source: html/9d238f70-a27d-02ab-a553-ec01d7a33c39.htm
---
# Autodesk.Revit.DB.EdgeArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual EdgeArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.